app/views/users/show.html.erb

<ul>
<% @user.games.each do |game| %>
---
SELECT "games".* FROM "games" WHERE (white_user_id = 1)