app/controllers/games_controller.rb

  def index
    @open_games = OpenGame.all
---
SELECT "games".* FROM "games" WHERE (white_user_id = 1)

  def update
    @game = Game.find(params[:id])
    move = params[:moves].split(" ")[-1]
    current_player_id = @game.current_player == "white" ? @game.white_user_id : @game.black_user_id

    if current_user.id == current_player_id && @game.try_move(move)
      if @game.checkmate
        @pgn = @game.make_pgn
        w = @game.white_player
        b = @game.black_player
        w.elo += @pgn.white_elo_diff
        b.elo += @pgn.black_elo_diff
        w.save!
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "games" SET "current_player" = 'black', "updated_at" = '2013-10-09 22:03:21.906620' WHERE "games"."id" = 1